Repository: xxshubhamxx/cmux-panecho
Catalog: Packages/macOS/CmuxSettingsUI/Sources/CmuxSettingsUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.team.invite.cancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# settings.team.invite.sendShort
source: Send
ar: إرسال
de: Senden
es: Enviar
fr: Envoyer
ja: 送信
ko: 보내기
zh_hans: 发送
zh_hant: 傳送

# settings.team.invite.short
source: Invite…
ar: دعوة…
de: Einladen…
es: Invitar…
fr: Inviter…
ja: 招待…
ko: 초대…
zh_hans: 邀请…
zh_hant: 邀請…

# settings.team.link.copyShort
source: Copy link
ar: نسخ الرابط
de: Link kopieren
es: Copiar enlace
fr: Copier le lien
ja: リンクをコピー
ko: 링크 복사
zh_hans: 复制链接
zh_hant: 複製連結

# settings.team.members
source: Members
ar: الأعضاء
de: Mitglieder
es: Miembros
fr: Membres
ja: メンバー
ko: 멤버
zh_hans: 成员
zh_hant: 成員

# settings.team.removeShort
source: Remove
ar: إزالة
de: Entfernen
es: Quitar
fr: Retirer
ja: 削除
ko: 제거
zh_hans: 移除
zh_hant: 移除

# settings.invitations.ignore
source: Ignore
ar: تجاهل
de: Ignorieren
es: Ignorar
fr: Ignorer
ja: 無視
ko: 무시
zh_hans: 忽略
zh_hant: 忽略

# settings.invitations.invitedBy
source: Invited by %1$@ · %2$@
ar: بدعوة من %1$@ · %2$@
de: Eingeladen von %1$@ · %2$@
es: Invitado por %1$@ · %2$@
fr: Invité par %1$@ · %2$@
ja: %1$@ からの招待 · %2$@
ko: %1$@ 님이 초대함 · %2$@
zh_hans: 由 %1$@ 邀请 · %2$@
zh_hant: 由 %1$@ 邀請 · %2$@

# settings.invitations.join
source: Join
ar: انضمام
de: Beitreten
es: Unirse
fr: Rejoindre
ja: 参加
ko: 참여
zh_hans: 加入
zh_hant: 加入

# settings.invitations.title
source: Invitations
ar: الدعوات
de: Einladungen
es: Invitaciones
fr: Invitations reçues
ja: 招待
ko: 초대
zh_hans: 邀请
zh_hant: 邀請

# settings.notifications.paneFlashThemeColor.subtitle
source: Use the terminal theme foreground for flashes; unread rings stay cmux blue.
ar: استخدم مقدمة سمة الطرفية للومضات؛ تبقى حلقات عدم القراءة باللون الأزرق لـ cmux.
de: Verwende die Vordergrundfarbe des Terminaldesigns für Blitze; ungelesene Ringe bleiben cmux-blau.
es: Usa el primer plano del tema de la terminal para los destellos; los anillos no leídos siguen siendo azules de cmux.
fr: Utiliser le premier plan du thème du terminal pour les flashs ; les anneaux non lus restent bleus cmux.
ja: フラッシュにターミナルテーマの前景色を使い、未読リングは cmux ブルーのままにします。
ko: 플래시에 터미널 테마 전경색을 사용하며 읽지 않은 링은 cmux 파란색으로 유지합니다.
zh_hans: 使用终端主题前景色显示闪烁；未读环保持 cmux 蓝色。
zh_hant: 使用終端主題前景色顯示閃爍；未讀環維持 cmux 藍色。

# settings.notifications.paneFlashThemeColor.title
source: Use Theme Foreground
ar: استخدام مقدمة السمة
de: Vordergrund des Designs verwenden
es: Usar el primer plano del tema
fr: Utiliser le premier plan du thème
ja: テーマの前景色を使う
ko: 테마 전경색 사용
zh_hans: 使用主题前景色
zh_hant: 使用主題前景色

# settings.terminal.showJumpToBottomButton
source: Jump to Bottom Button
ar: زر الانتقال إلى الأسفل
de: Schaltfläche „Zum Ende springen“
es: Botón Ir al final
fr: Bouton Aller en bas
ja: 「一番下へ移動」ボタン
ko: 맨 아래로 이동 버튼
zh_hans: “跳到底部”按钮
zh_hant: 「跳至底部」按鈕

# settings.terminal.showJumpToBottomButton.subtitle
source: Shows a Jump to Bottom button while you scroll a terminal up into its scrollback. Full-screen programs such as vim, less, or an agent's fullscreen mode handle their own scrolling and never show it.
ar: يعرض زر الانتقال إلى الأسفل أثناء التمرير لأعلى في سجل الطرفية. البرامج بملء الشاشة مثل vim وless أو وضع ملء الشاشة للوكيل تتولى التمرير بنفسها ولا تعرضه أبدًا.
de: Zeigt die Schaltfläche „Zum Ende springen“, während du in einem Terminal im Verlauf nach oben scrollst. Vollbildprogramme wie vim, less oder der Vollbildmodus eines Agenten scrollen selbst und zeigen sie nie.
es: Muestra un botón Ir al final mientras te desplazas hacia arriba en el historial de una terminal. Los programas a pantalla completa como vim, less o el modo de pantalla completa de un agente gestionan su propio desplazamiento y nunca lo muestran.
fr: Affiche un bouton Aller en bas lorsque vous remontez dans l'historique d'un terminal. Les programmes plein écran comme vim, less ou le mode plein écran d'un agent gèrent leur propre défilement et ne l'affichent jamais.
ja: ターミナルのスクロールバックを上にスクロールしている間、「一番下へ移動」ボタンを表示します。vim、less、エージェントのフルスクリーンモードなどのフルスクリーンプログラムは独自にスクロールを扱うため、表示されません。
ko: 터미널의 스크롤백을 위로 스크롤하는 동안 맨 아래로 이동 버튼을 표시합니다. vim, less 또는 에이전트의 전체 화면 모드 같은 전체 화면 프로그램은 스크롤을 직접 처리하므로 표시되지 않습니다.
zh_hans: 在终端中向上滚动回滚内容时显示“跳到底部”按钮。vim、less 或代理的全屏模式等全屏程序会自行处理滚动，永远不会显示此按钮。
zh_hant: 在終端機中向上捲動回溯內容時顯示「跳至底部」按鈕。vim、less 或代理的全螢幕模式等全螢幕程式會自行處理捲動，永遠不會顯示此按鈕。

# settings.automation.agentMessages
source: Agent Messages
ar: رسائل الوكلاء
de: Agent-Nachrichten
es: Mensajes de agentes
fr: Messages d'agents
ja: エージェントメッセージ
ko: 에이전트 메시지
zh_hans: 代理消息
zh_hant: 代理訊息

# settings.automation.agentMessages.note
source: Turning this off also fails messages that are waiting to be delivered. To turn messages off for one agent, run cmux agent messages off in its terminal.
ar: يؤدي إيقاف هذا الخيار أيضًا إلى إفشال الرسائل التي تنتظر التسليم. لإيقاف الرسائل لوكيل واحد، شغّل cmux agent messages off في طرفيته.
de: Beim Ausschalten schlagen auch Nachrichten fehl, die noch auf Zustellung warten. Um Nachrichten nur für einen Agenten auszuschalten, führe cmux agent messages off in seinem Terminal aus.
es: Al desactivarlo también fallan los mensajes que esperan entrega. Para desactivar los mensajes de un solo agente, ejecuta cmux agent messages off en su terminal.
fr: La désactivation fait aussi échouer les messages en attente de remise. Pour désactiver les messages d'un seul agent, exécutez cmux agent messages off dans son terminal.
ja: オフにすると、配信待ちのメッセージも失敗になります。1 つのエージェントだけメッセージをオフにするには、そのターミナルで cmux agent messages off を実行してください。
ko: 끄면 전달을 기다리는 메시지도 실패 처리됩니다. 에이전트 하나만 메시지를 끄려면 해당 터미널에서 cmux agent messages off를 실행하세요.
zh_hans: 关闭后，等待投递的消息也会标记为失败。若只想关闭某个代理的消息，请在它的终端中运行 cmux agent messages off。
zh_hant: 關閉後，等待遞送的訊息也會標為失敗。若只要關閉某個代理的訊息，請在它的終端機中執行 cmux agent messages off。

# settings.automation.agentMessages.subtitleOff
source: Agent messages are off. Sends fail and nothing is delivered.
ar: رسائل الوكلاء متوقفة. يفشل الإرسال ولا يُسلَّم شيء.
de: Agent-Nachrichten sind aus. Senden schlägt fehl und nichts wird zugestellt.
es: Los mensajes de agentes están desactivados. Los envíos fallan y no se entrega nada.
fr: Les messages d'agents sont désactivés. Les envois échouent et rien n'est remis.
ja: エージェントメッセージはオフです。送信は失敗し、何も配信されません。
ko: 에이전트 메시지가 꺼져 있습니다. 전송이 실패하고 아무것도 전달되지 않습니다.
zh_hans: 代理消息已关闭。发送会失败，也不会投递任何消息。
zh_hant: 代理訊息已關閉。傳送會失敗，也不會遞送任何訊息。

# settings.automation.agentMessages.subtitleOn
source: Agents can message each other with cmux agent message.
ar: يمكن للوكلاء مراسلة بعضهم باستخدام cmux agent message.
de: Agenten können sich mit cmux agent message gegenseitig Nachrichten senden.
es: Los agentes pueden enviarse mensajes con cmux agent message.
fr: Les agents peuvent s’envoyer des messages avec cmux agent message.
ja: エージェント同士が cmux agent message でメッセージを送り合えます。
ko: 에이전트끼리 cmux agent message로 메시지를 보낼 수 있습니다.
zh_hans: 代理可以使用 cmux agent message 互相发送消息。
zh_hant: 代理可以使用 cmux agent message 互相傳送訊息。

# settings.terminal.ghostty.middleClickPaste
source: Middle-Click Paste
ar: اللصق بالنقر الأوسط
de: Einfügen per Mittelklick
es: Pegar con clic central
fr: Coller avec le clic du milieu
ja: 中クリックで貼り付け
ko: 가운데 클릭으로 붙여넣기
zh_hans: 中键点按粘贴
zh_hant: 中鍵點按貼上

# settings.terminal.ghostty.middleClickPaste.mouseApps
source: Apps that use the mouse still get middle clicks.
ar: تظل التطبيقات التي تستخدم الماوس تتلقى النقرات الوسطى.
de: Apps, die die Maus verwenden, erhalten weiterhin Mittelklicks.
es: Las apps que usan el ratón siguen recibiendo los clics centrales.
fr: Les apps qui utilisent la souris reçoivent toujours les clics du milieu.
ja: マウスを使うアプリには引き続き中クリックが送られます。
ko: 마우스를 사용하는 앱은 계속 가운데 클릭을 받습니다.
zh_hans: 使用鼠标的 App 仍会收到中键点按。
zh_hant: 使用滑鼠的 App 仍會收到中鍵點按。
